# Parameter Type Id Mep Segment Flow Characteristic Property

Source: https://www.revitapidocs.com/2026/df87199e-2908-5e86-6d29-bfcf6b39d3b0.htm

---

| Parameter Type Id Mep Segment Flow Characteristic Property |
| --- |

"Flow Characteristic"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MepSegmentFlowCharacteristic { get; }
```

```
Public Shared ReadOnly Property MepSegmentFlowCharacteristic As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MepSegmentFlowCharacteristic {
	ForgeTypeId^ get ();
}
```

```
static member MepSegmentFlowCharacteristic : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace